services/121-service/src/shared/xml/AccountEnquiry.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:cber="http://temenos.com/CBEREMITANCE">
  <soapenv:Header/>
  <soapenv:Body>
    <cber:AccountEnquiry>
      <WebRequestCommon>
        <company/>
        <password>${password}</password>
        <userName>${username}</userName>
      </WebRequestCommon>
      <EACCOUNTCBEREMITANCEType>
        <enquiryInputCollection>
          <columnName>ID</columnName>
          <criteriaValue>${creditAcctNo}</criteriaValue>
          <operand>EQ</operand>
        </enquiryInputCollection>
      </EACCOUNTCBEREMITANCEType>
    </cber:AccountEnquiry>
  </soapenv:Body>
</soapenv:Envelope>
